Importing required libraries

In [1]:
import numpy as np
import pandas as pd

Displaying the first dataset

In [3]:
df = pd.read_csv('u.data', sep='\t')
df.head()

     0   50  5  881250949
0    0  172  5  881250949
1    0  133  1  881250949
2  196  242  3  881250949
3  186  302  3  891717742
4   22  377  1  878887116

Changing column names of the above dataset

In [4]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
df = pd.read_csv('u.data', sep='\t', names=column_names)
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

Displaying the second dataset

In [6]:
movie_titles = pd.read_csv("Movie_Id_Titles")
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [7]:
movie_titles = pd.read_csv("Movie_Id_Titles")
df = pd.merge(df,movie_titles,on='item_id')
df.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

Creating a dataframe with average ratings and number of ratings from the above dataframe

In [8]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())
ratings['num of ratings'] = pd.DataFrame(df.groupby('title')['rating'].count())
ratings.head()

                             rating  num of ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41

Creating a matrix with user_id on one axis and title on another axis. The values in the matrix are the ratings for the movies provided by users

In [9]:
moviemat = df.pivot_table(index='user_id',columns='title',values='rating')
moviemat.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Demonstrating a use-case through the example of the movie: Batman Forever (1995)

In [10]:
movie_user_ratings = moviemat['Batman Forever (1995)']
movie_user_ratings.head()

user_id
0    NaN
1    1.0
2    NaN
3    NaN
4    NaN
Name: Batman Forever (1995), dtype: float64

Using corrwith() method to get similar movies

In [11]:
similar_to_movie = moviemat.corrwith(movie_user_ratings)
similar_to_movie.head()

C:\Users\vishal\anaconda3\lib\site-packages\numpy\lib\function_base.py:2551: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar)
C:\Users\vishal\anaconda3\lib\site-packages\numpy\lib\function_base.py:2480: RuntimeWarning: divide by zero encountered in true_divide
  c *= np.true_divide(1, fact)

title
'Til There Was You (1997)         NaN
1-900 (1994)                -1.000000
101 Dalmatians (1996)        0.360254
12 Angry Men (1957)         -0.264723
187 (1997)                   0.218218
dtype: float64

Presenting as dataframe and removing NaN values

In [28]:
corr_movie = pd.DataFrame(similar_to_movie,columns=['Correlation'])
corr_movie.dropna(inplace=True)
corr_movie.columns

Index(['Correlation'], dtype='object')

In [29]:
corr_movie.head()

                             Correlation
title
1-900 (1994)                   -1.000000
101 Dalmatians (1996)           0.360254
12 Angry Men (1957)            -0.264723
187 (1997)                      0.218218
2 Days in the Valley (1996)     0.016757

Combining corr_movie dataframe and number_of_ratings dateframe in order to filter out movies that have less than 100 ratings

In [30]:
#Extracting the 'num of ratings' column from ratings dataframe and converting it into a dataframe
number_of_ratings = pd.DataFrame(ratings['num of ratings'])
number_of_ratings = pd.DataFrame(number_of_ratings['num of ratings'])
number_of_ratings.columns

Index(['num of ratings'], dtype='object')

In [31]:
number_of_ratings.head()

                           num of ratings
title
'Til There Was You (1997)               9
1-900 (1994)                            5
101 Dalmatians (1996)                 109
12 Angry Men (1957)                   125
187 (1997)                             41

In [32]:
# Merging corr_movie and number_of_ratings dataframes on the common column of title
corr_movie = pd.merge(corr_movie,number_of_ratings, on='title')
corr_movie.columns

Index(['Correlation', 'num of ratings'], dtype='object')

In [33]:
corr_movie.head()

                             Correlation  num of ratings
title
1-900 (1994)                   -1.000000               5
101 Dalmatians (1996)           0.360254             109
12 Angry Men (1957)            -0.264723             125
187 (1997)                      0.218218              41
2 Days in the Valley (1996)     0.016757              93

In [34]:
#Removing movies that have less than 100 ratings
corr_movie[corr_movie['num of ratings']>100].sort_values('Correlation',ascending=False).head()

                           Correlation  num of ratings
title
Batman Forever (1995)         1.000000             114
Down Periscope (1996)         0.624417             101
Jungle2Jungle (1997)          0.611052             132
As Good As It Gets (1997)     0.587782             112
Net, The (1995)               0.568909             120